# 农批

坦克 = ["苏烈", "刘邦", "钟馗", "……"]
战士 = ["狂铁", "裴擒虎", "凯", "……"]
刺客 = ["百里玄策", "庞统", "花木兰", "……"]
法师 = ["杨玉环", "奕星", "女娲", "……"]
射手 = ["公孙离", "百里守约", "后羿", "……"]
辅助 = ["明世隐", "梦奇", "孙膑", "……"]

print("“王者荣耀”游戏角色：")
print("====坦克：====")
for 英雄 in 坦克:
    print(英雄, end=" ")
print("\n====战士：====")
for 英雄 in 战士:
    print(英雄, end=" ")
print("\n====刺客：====")
for 英雄 in 刺客:
    print(英雄, end=" ")
print("\n====法师：====")
for 英雄 in 法师:
    print(英雄, end=" ")
print("\n====射手：====")
for 英雄 in 射手:
    print(英雄, end=" ")
print("\n====辅助：====")
for 英雄 in 辅助:
    print(英雄, end=" ")