head = ("车次", "出发站—到达站", "出发时间", "到达时间", "历时")
train = [
    ("T40", "长春—北京", "00:12", "12:20", "12:08"),
    ("T298", "长春—北京", "00:06", "10:50", "10:44"),
    ("Z158", "长春—北京", "12:48", "21:06", "08:18"),
    ("Z62", "长春—北京", "21:58", "06:08", "08:20"),
]
print(head[0], head[1], head[2], head[3], head[4], sep="\t")
for set in train:
    print("%-8s%-12s%-16s%-16s%s" % (set[0], set[1], set[2], set[3], set[4]))
buy_train = input("请输入要购买的车次：")
buy_man = input("请输入乘车人（用逗号分隔）：")
for set in train:
    if buy_train == set[0]:
        print(f"您已购{set[0]}次列车 {set[1]} {set[2]} 开，请{buy_man}尽快换取纸质车票。【铁路客服】")
