license_plate_attribution = {
    "京": "北京",
    "沪": "上海",
    "津": "天津",
    "渝": "重庆",
    "冀": "河北",
    "晋": "山西",
    "蒙": "内蒙古",
    "辽": "辽宁",
    "吉": "吉林",
    "黑": "黑龙江",
    "苏": "江苏",
    "浙": "浙江",
    "皖": "安徽",
    "闽": "福建",
    "赣": "江西",
    "鲁": "山东",
    "豫": "河南",
    "鄂": "湖北",
    "湘": "湖南",
    "粤": "广东",
    "桂": "广西",
    "琼": "海南",
    "川": "四川",
    "贵": "贵州",
    "云": "云南",
    "藏": "西藏",
    "陕": "陕西",
    "甘": "甘肃",
    "青": "青海",
    "宁": "宁夏",
    "新": "新疆",
}

i = 1
while True:
    license = input(f"第{i}张车牌号码：\n")
    if license.startswith(tuple(license_plate_attribution.keys())):
        print(f"这张车牌的归属地：{license_plate_attribution[license[0]]}")
        i+=1
    else:
        pass
